05-Implementation/SARAPP-sa-UP/app/controllers/stores_controller.rb

  def index

    # SEARCH STORE
    @stores = Store.all
---
SELECT "stores".* FROM "stores" WHERE (Store_Location like '%{search}%') AND (Store_Location like '%{search}%')

  def create
    @store = Store.new(store_params)
    respond_to do |format|
      if(Store.exists?(:Store_Name => store_params[:Store_Name]))
        #format.html { redirect_to stores_url, notice: 'Store exists. I still added the store tho, so please delete it. ;)' }
        format.json { render json: @store.errors, status: :unprocessable_entity }
      end
      if @store.save
---
SELECT  "stores".* FROM "stores" WHERE "stores"."Store_Name" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "stores" WHERE "stores"."Store_Name" = ? LIMIT ?  [["Store_Name", "CASAA"], ["LIMIT", 1]]
INSERT INTO "stores" ("Store_Name", "Store_Location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Store_Name", "CASAA"], ["Store_Location", "behind Palma Hall"], ["created_at", 2017-01-29 16:19:00 UTC], ["updated_at", 2017-01-29 16:19:00 UTC]]

  def update
    respond_to do |format|
      if @store.update(store_params)
---
UPDATE "stores" SET "Store_Location" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["Store_Location", "Palma Hall"], ["updated_at", 2017-01-29 16:19:08 UTC], ["id", 1]]

  def destroy
    @store.destroy
---
DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 10]]

    def set_store
      @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]